## production: dns
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 6 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                                       NAME                                                       |
|--------|------------------------------------------------------------------------------------------------------------------|
| add    | `aws_ses_domain_dkim.custom_sending_domains[&quot;notification.elections.canada.ca&quot;]`                                 |
|        | `aws_ses_domain_mail_from.custom_sending_domains[&quot;notification.elections.canada.ca&quot;]`                            |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic[&quot;notification.elections.canada.ca&quot;]`    |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic[&quot;notification.elections.canada.ca&quot;]` |
|        | `aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic[&quot;notification.elections.canada.ca&quot;]`  |
|        | `aws_sesv2_email_identity.custom_sending_domains[&quot;notification.elections.canada.ca&quot;]`                            |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ses_domain_dkim.custom_sending_domains["notification.elections.canada.ca"] will be created
  + resource "aws_ses_domain_dkim" "custom_sending_domains" {
      + dkim_tokens = (known after apply)
      + domain      = "notification.elections.canada.ca"
      + id          = (known after apply)
    }

  # aws_ses_domain_mail_from.custom_sending_domains["notification.elections.canada.ca"] will be created
  + resource "aws_ses_domain_mail_from" "custom_sending_domains" {
      + behavior_on_mx_failure = "UseDefaultValue"
      + domain                 = "notification.elections.canada.ca"
      + id                     = (known after apply)
      + mail_from_domain       = "bounce.notification.elections.canada.ca"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_bounce_topic["notification.elections.canada.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_bounce_topic" {
      + id                       = (known after apply)
      + identity                 = "notification.elections.canada.ca"
      + include_original_headers = false
      + notification_type        = "Bounce"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_complaint_topic["notification.elections.canada.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_complaint_topic" {
      + id                       = (known after apply)
      + identity                 = "notification.elections.canada.ca"
      + include_original_headers = false
      + notification_type        = "Complaint"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_ses_identity_notification_topic.custom_sending_domains_delivery_topic["notification.elections.canada.ca"] will be created
  + resource "aws_ses_identity_notification_topic" "custom_sending_domains_delivery_topic" {
      + id                       = (known after apply)
      + identity                 = "notification.elections.canada.ca"
      + include_original_headers = false
      + notification_type        = "Delivery"
      + topic_arn                = "arn:aws:sns:ca-central-1:296255494825:ses-callback"
    }

  # aws_sesv2_email_identity.custom_sending_domains["notification.elections.canada.ca"] will be created
  + resource "aws_sesv2_email_identity" "custom_sending_domains" {
      + arn                         = (known after apply)
      + email_identity              = "notification.elections.canada.ca"
      + id                          = (known after apply)
      + identity_type               = (known after apply)
      + tags_all                    = (known after apply)
      + verified_for_sending_status = (known after apply)

      + dkim_signing_attributes (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ custom_sending_domains_dkim           = [
      - {
          - domain = "notification.gov.bc.ca"
          - token  = "pypemga4ooemc3thf5h4p6jpcv5ieme2"
        },
      - {
          - domain = "notification.gov.bc.ca"
          - token  = "wp5wrojykc637go6gqaag7debuvk7suc"
        },
      - {
          - domain = "notification.gov.bc.ca"
          - token  = "om56oqvtknft7qeocs5offdcqcwvbpiu"
        },
      - {
          - domain = "notify.novascotia.ca"
          - token  = "r7e7juygsbrvjaj3ceuvpnjwksgi7vrs"
        },
      - {
          - domain = "notify.novascotia.ca"
          - token  = "3xxbqbyriwlz52t6wmydijkqtrwmikru"
        },
      - {
          - domain = "notify.novascotia.ca"
          - token  = "jit2blavxo37qnw3ekgn2ph4gazq3ufb"
        },
    ] -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.internal_dns"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_cert_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_fqdn"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.internal_dns_key_base64"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"notification.elections.canada.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"notification.gov.bc.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.custom_sending_domains[\"notify.novascotia.ca\"]"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_sesv2_email_identity.notification-canada-ca-receiving"]

30 tests, 19 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
